---
kind: property
id: P:Autodesk.Revit.DB.Outline.MaximumPoint
source: html/c615ccfc-a501-c9db-bbc2-15fb11723ce0.htm
---
# Autodesk.Revit.DB.Outline.MaximumPoint Property

The maximum point of the bounding box.

## Syntax (C#)
```csharp
public XYZ MaximumPoint { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null